tutorials/multiRegionPlateFin_new/0/solid/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/solid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 273;

boundaryField
{
    Wall
    {
        type            fixedValue;
        value           uniform 283;
    }
    Symmetry
    {
        type            symmetryPlane;
    }
    InSolid
    {
        type                    zeroGradient;
        /*
        type                     regionCoupleHeatFlux;
        neighbourRegionName      fluid;
        neighbourPatchName       OutWallFluid;
        neighbourFieldName       T;
        value                    $internalField;
        */
    }
    CyclicSolid
    {
        type           cyclic;
    }
    OutSolid
    {
        type                    zeroGradient;
        /*
        type                     regionCoupleHeatFlux;
        neighbourRegionName      fluid;
        neighbourPatchName       InWallFluid;
        neighbourFieldName       T;
        value                    $internalField;
        */
    }
    solid_to_fluid
    {
        type                     regionCoupleHeatFlux;
        neighbourRegionName      fluid;
        neighbourPatchName       fluid_to_solid;
        neighbourFieldName       T;
        value                    $internalField;
    }
}

// ************************************************************************* //
